costrade_api/app/controllers/users_controller.rb

  def create
    # @user = User.new(user_params)
    # @user = User.create(params.require(:user).permit(:username, :password))
    @user = User.create(params.require(:user).permit(:username, :password))
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def register
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "ga"], ["password_digest", "$2a$12$ppNS0//N94CtO77P0edN4OW2w.DORWnQjWbmTlVE1lKF2gzPqPGn6"], ["created_at", "2020-02-06 02:35:17.989499"], ["updated_at", "2020-02-06 02:35:17.989499"]]